app/controllers/api/products_controller.rb

SELECT "product".* FROM "product" ORDER BY "product"."product_id" ASC
---
    def index
      render json: Product.order(:product_id)

INSERT INTO "product" ("name", "price") VALUES ('Wireless Mouse', 25.99) RETURNING "product_id"
---
    def create
      product = Product.new(product_params)

      if product.save