app/controllers/api/store_ins_controller.rb

SELECT "store_in".* FROM "store_in" ORDER BY "store_in"."id" ASC
---
    def index
      render json: StoreIn.order(:id)

INSERT INTO "store_in" ("product_id", "quantity", "date") VALUES (2, 13, '2026-03-11') RETURNING "id"
---
    def create
      store_in = StoreIn.new(store_in_params)

      if store_in.save