app/controllers/api/store_outs_controller.rb

SELECT "store_out".* FROM "store_out" ORDER BY "store_out"."id" ASC
---
    def index
      render json: StoreOut.order(:id)